tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Next-gen compiler infrastructure
brew "llvm"
# Language Server for the Lua language
brew "lua-language-server"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Menu bar icon organizer
cask "bartender"
# Voice and text chat software
cask "discord"
# Custom Minecraft Launcher
cask "gdlauncher"
# Web browser
cask "google-chrome"
# Hides the Dock when it is overlapped by a window
cask "intellidock"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer"
# Control your tools with a few keystrokes
cask "raycast"
# Screenshot measurement and annotation tool
cask "shottr"
# Open-source code editor
cask "visual-studio-code"
mas "BetterSnapTool", id: 417375580
mas "Dropover", id: 1355679052
mas "HotKey", id: 975890633
