# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Brews
brew "bat"
brew "exa"
brew "fd"
brew "httpie"
brew "lua-language-server"
brew "neofetch"
brew "neovim"
brew "python@3.10"
brew "ripgrep"

# Casks
cask "bartender"
cask "discord"
cask "google-chrome"
cask "intellidock"
cask "iterm2"
cask "karabiner-elements"
cask "prusaslicer"
cask "raycast"
cask "shottr"
cask "visual-studio-code"
